---
type: DefinitionFile
namespace: Autodesk.Revit.DB
version: 2024
members: 2
tags: [revit-api, class]
---

# DefinitionFile

`Autodesk.Revit.DB.DefinitionFile` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | Filename | — | `public string Filename { get ; }` |
| Property | Groups | — | `public DefinitionGroups Groups { get ; }` |